NCE2/L86 Out of control.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-06 Tue 22:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org28055db" class="outline-2">
<h2 id="org28055db">Lesson 86 Out of control</h2>
<div class="outline-text-2" id="text-org28055db">
<p class="verse">
What was the danger?<br />
<br />
As the man tried to swing the speedboat round, the steering wheel <b>came away</b> in his hands.<br />
He waved desperately to his companion, who had been water skiing for the last fifteen minutes.<br />
Both men had hardly had time to realize what was happening<br />
&#xa0;when they were thrown violently into the sea.<br />
The speedboat had struck a buoy,<br />
&#xa0;but it continued to move very quickly across the water.<br />
Both men had just begun to swim towards the shore,<br />
&#xa0;when <b>they noticed with dismay</b> that the speedboat was moving <b>in a circle</b>.<br />
It now came straight towards them <b>at tremendous speed</b>.<br />
In less than a minute, it roared past them only a few feet away.<br />
After it had passed,<br />
&#xa0;they swam on as quickly as they could because they knew that the boat would soon return.<br />
They had just had enough time to swim out of danger<br />
&#xa0;when the boat again completed a circle.<br />
On this occasion, however, it had slowed down considerably.<br />
The petrol had nearly all <b>been used up</b>.<br />
<b>Before long</b>, the noise dropped completely and the boat began to drift gently across the water.<br />
</p>
</div>
<div id="outline-container-orgca01c7c" class="outline-3">
<h3 id="orgca01c7c">expression</h3>
<div class="outline-text-3" id="text-orgca01c7c">
<p>
swing [swɪŋ] swung v.转向<br />
speedboat [ˈspidˌboʊt] n.快艇<br />
desperately [ˈdesp(ə)rət(ə)li] adv.绝望地<br />
companion [kəmˈpænjən] n. 同伴,伙伴<br />
water [ˈwɔtər] ski [ski] (由快艇牵引)滑水<br />
buoy [ˈbui] n.浮标<br />
dismay [dɪsˈmeɪ] n.沮丧<br />
tremendous [trəˈmendəs] adj.巨大的<br />
petrol [ˈpetrəl] n.汽油<br />
drift [drɪft] v.漂动,漂流<br />
gently [ˈdʒentli] adv.缓慢地,轻轻地<br />
</p>

<p>
sb. noticed with dismay that + &#x2026; 某人惊慌地注意到……<br />
at tremendous speed 以惊人的速度<br />
</p>
<hr />
<p>
come away 脱落<br />
move in a circle 以圈移动<br />
be used up 用完<br />
before long 不久之后<br />
</p>
</div>
</div>


<div id="outline-container-org43a2c26" class="outline-3">
<h3 id="org43a2c26">words</h3>
<div class="outline-text-3" id="text-org43a2c26">
<p>
swing [swɪŋ] v.转向<br />
speedboat [ˈspidˌboʊt] n.快艇<br />
desperately [ˈdesp(ə)rət(ə)li] adv.绝望地<br />
companion [kəmˈpænjən] n.同伙,伙伴<br />
water ski [ˈwɔtər-,ski] 滑水<br />
buoy [ˈbui] n.浮标<br />
dismay [dɪsˈmeɪ] n.沮丧<br />
tremendous [trəˈmendəs] adj.巨大的<br />
petrol [ˈpetrəl] n.汽油<br />
drift [drɪft] v.漂动,漂流<br />
gently [ˈdʒentli] adv.缓慢地,轻轻地<br />
</p>
</div>
</div>

<div id="outline-container-org10b8d97" class="outline-3">
<h3 id="org10b8d97"><span class="done DONE">DONE</span> 单词造句</h3>
<div class="outline-text-3" id="text-org10b8d97">
<p>
swing swung v.<br />
</p>
<ul class="org-ul">
<li>In return for this, I teach her how to swing.<br /></li>
<li>His arms are used to swinging as he walks.<br /></li>
<li>It is no coincidence that they swing their cars round at the same time.<br /></li>
<li>He kept on swinging his car in the street.<br /></li>
<li>Instead of fishing, I am instered in swinging on the tree.<br /></li>
</ul>
<p>
speedboat n.<br />
</p>
<ul class="org-ul">
<li>He was said to be so rich that he had a speedboat.<br /></li>
<li>The company made such a profit that the boss bought a speedboat.<br /></li>
<li>Joey was relieved to hear that the speedboat wasn't sold.<br /></li>
<li>We will remember him for his luxury speedboat.<br /></li>
<li>She is due to buy an entirely new speedboat.<br /></li>
</ul>
<p>
desperately adv.<br />
</p>
<ul class="org-ul">
<li>They decided desperately to go on strike.<br /></li>
<li>He hasn't been studying English, and he will take the test desperately.<br /></li>
<li>The busmen objected desperately that the students will drive too fast.<br /></li>
<li>Under a lot of pressure, she got desperately to her children as possible as she could.<br /></li>
<li>He tried desperately to put forward the plan.<br /></li>
</ul>
<p>
companion n.<br />
</p>
<ul class="org-ul">
<li>My companion is a huge fan of football.<br /></li>
<li>On the following day, my companion won the election.<br /></li>
<li>My companion is losing his temper in the game over and over again.<br /></li>
<li>My companion online was found to be my father.<br /></li>
<li>My companion has caught a peculiar fish out at sea.<br /></li>
</ul>
<p>
water ski<br />
</p>
<ul class="org-ul">
<li>In his thirties, he devoted himself to water skiing.<br /></li>
<li>I love to go water ski on vacations.<br /></li>
<li>The girl insisted on going water skiing with her father.<br /></li>
<li>He is fanatical about water skiing.<br /></li>
<li>It is known that he used to go water skiing out at sea.<br /></li>
</ul>
<p>
buoy n.<br />
</p>
<ul class="org-ul">
<li>I and my companion were swiming to the buoy at the same time.<br /></li>
<li>It is no use pretending that the buoy wasn't there.<br /></li>
<li>He discovered that the buoy wasn't there.<br /></li>
<li>The boat sailed rapidly towards the buoy.<br /></li>
<li>He swam up and down in front of the buoy.<br /></li>
</ul>
<p>
dismay n. sb. noticed with dismay that + &#x2026;<br />
</p>
<ul class="org-ul">
<li>He noticed with dismay that the plants were growing rapidly.<br /></li>
<li>I noticed with dismay that he had knocked his wife to the ground.<br /></li>
<li>I noticed with dismay that the plane gain height slowly.<br /></li>
<li>She noticed with dismay that she couldn't send a signal to ask for help in the mountains.<br /></li>
<li>The driver noticed with dismay that a bomb had been planted.<br /></li>
</ul>
<p>
tremendous adj. at tremendous speed<br />
</p>
<ul class="org-ul">
<li>This is such a tremendous honor that I follow in my father's footsteps.<br /></li>
<li>It will have tremendous effort on you.<br /></li>
<li>It entitled the speedboat to sail at tremendous speed.<br /></li>
<li>The busmen drived bus at two thieves at tremendous speed.<br /></li>
<li>The lottery carried hundreds of boxes of fruits to Paris at tremendous speed.<br /></li>
</ul>
<p>
petrol n.<br />
</p>
<ul class="org-ul">
<li>I took precaution and met her at the petrol station.<br /></li>
<li>After a long journey, we found a petrol station in the village.<br /></li>
<li>It was not long before the petrol station was planted a bomb.<br /></li>
<li>"Get out of here", she shouted at me at the petrol station.<br /></li>
<li>Thank you for coming at the petrol station on such short notice.<br /></li>
</ul>
<p>
drift v.<br />
</p>
<ul class="org-ul">
<li>The boat is drifting down the river.<br /></li>
<li>I'd like to be in a boat which is drifting down the river.<br /></li>
<li>The boy was disappointed to learn that the ball was drifting on the river.<br /></li>
<li>The boy noticed with dismay that his ball was drifting on the river.<br /></li>
<li>No one counld account for the fact that the boat was drifting on the river.<br /></li>
</ul>
<p>
gently adv.<br />
</p>
<ul class="org-ul">
<li>He got close to her gently at the time.<br /></li>
<li>The examiner tapped gently on the window.<br /></li>
<li>I am instructed to treat my wife gently.<br /></li>
<li>For your safety, you'd better touch it gently.<br /></li>
<li>"Don't make that stupid remark.He has a very bad temper." She said gently.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgbee0e53" class="outline-3">
<h3 id="orgbee0e53"><span class="done DONE">DONE</span> 反复听电影片段</h3>
<div class="outline-text-3" id="text-orgbee0e53">
</div>
</div>
<div id="outline-container-org01cc8c6" class="outline-3">
<h3 id="org01cc8c6"><span class="done DONE">DONE</span> Pattern Drill 写+读</h3>
<div class="outline-text-3" id="text-org01cc8c6">
<ul class="org-ul">
<li>1t: post the letter<br />
s1: Did he post the letter when you asked him to?<br />
s2: He'd already posted it.<br />
<ul class="org-ul">
<li>pay the bill<br />
Did he pay the bill when you asked him to?<br />
He'd already paid it.<br /></li>
<li>mend the boat<br />
Did he mend the boat when you asked him to?<br />
He'd already mended it.<br /></li>
<li>cut the glass<br />
Did he cut the glass when you asked him to?<br />
He'd already cut it.<br /></li>
<li>sign the paper<br />
Did he sign the paper when you asked him to?<br />
He'd already signed it.<br /></li>
</ul></li>
<li>2t: use - the iron - put away<br />
s1: Can I use the iron after you, please?<br />
s2: I'm sorry. I put it away after I'd used it.<br />
<ul class="org-ul">
<li>read - the paper - throw away<br />
Can I read the paper after you, please?<br />
I'm sorry. I threw it away after I'd read it.<br /></li>
<li>study - the note - tear up<br />
Can I study the note after you, please?<br />
I'm sorry. I tore it up after I'd studied it.<br /></li>
<li>talk to - the boy - send home<br />
Can I talk to the boy after you, please?<br />
I'm sorry. I send him home after I'd talked to him.<br /></li>
<li>look at - the photos - give to Mary<br />
Can I look at the photos after you, please?<br />
I'm sorry. I gave them to Mary after I'd looked at them.<br /></li>
</ul></li>
<li>3t: see a bad film<br />
s1: Why did you see such a bad film?<br />
s2: I hadn't seen it before, so I didn't know it was bad.<br />
<ul class="org-ul">
<li>read a dull book<br />
Why did you read such a dull book?<br />
I hadn't read it before, so I didn't know it was dull.<br /></li>
<li>speak to a rude man<br />
Why did you speak to such a rude man?<br />
I hadn't spoken to him before, so I didn't know he was rude.<br /></li>
<li>order bad wine<br />
Why did you order such a bad wine?<br />
I hadn't ordered it, so I didn't know it was bad.<br /></li>
<li>use thick oil<br />
Why did you use such thick oil?<br />
I hadn't used it, so I didn't know it was thick.<br /></li>
</ul></li>
<li>4t: hot - running<br />
s1: Why was he so hot when he got home?<br />
s2: He'd been running.<br />
<ul class="org-ul">
<li>tired - working angry - quarrelling<br />
Why was he so tired when he got home?<br />
He'd been working.<br /></li>
<li>hungry - swimming happy - celebrating<br />
Why was he so hungry when he got home?<br />
He'd been swimming.<br /></li>
<li>rude - drinking dirty - gardening<br />
Why was he so rude when he got home?<br />
He'd been drinking.<br /></li>
<li>nervous - fighting miserable - crying<br />
Why was he so nervous when he got home?<br />
He'd been fighting.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb7cb8b1" class="outline-3">
<h3 id="orgb7cb8b1"><span class="done DONE">DONE</span> 给自己讲解</h3>
<div class="outline-text-3" id="text-orgb7cb8b1">
</div>
</div>
<div id="outline-container-org199a990" class="outline-3">
<h3 id="org199a990">红皮书</h3>
</div>
<div id="outline-container-org0382374" class="outline-3">
<h3 id="org0382374"><span class="done DONE">DONE</span> 习惯用法造句</h3>
<div class="outline-text-3" id="text-org0382374">
<p>
come away<br />
</p>
<ul class="org-ul">
<li>The paper has started to come away from the bulletin.<br /></li>
<li>Let's suppose that the paper came away from the bulletin.<br /></li>
<li>I noticed with dismay that the paper had came away in my hands.<br /></li>
<li>The cat came away from my house.<br /></li>
<li>He managed to come away from the prison.<br /></li>
</ul>
<p>
move in a circle<br />
</p>
<ul class="org-ul">
<li>Gather round and stand in a circle.<br /></li>
<li>Why don't we sit in a circle?<br /></li>
<li>A large crowd of young boys and young girls were walking in a circle.<br /></li>
<li>Pupils of the school were instructed to sit in a circle.<br /></li>
<li>A party of teacher refused to stand in a circle.<br /></li>
</ul>
<p>
use up<br />
</p>
<ul class="org-ul">
<li>She's used up all water in the desert.<br /></li>
<li>The petrol was used up before she drove to next village.<br /></li>
<li>It is said that he has used up all money.<br /></li>
<li>Why did you use up all the glue last night?<br /></li>
<li>The petrol was used up in twenty minutes' time.<br /></li>
</ul>
<p>
before long<br />
</p>
<ul class="org-ul">
<li>Before long, I will build a wood bridge.<br /></li>
<li>Before long, the boat will cross the Atlantic.<br /></li>
<li>Before long, the search party received a warm welcome.<br /></li>
<li>Before long, she will also get a good salary.<br /></li>
<li>Before long, you will be allowed to go to Beijing.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgfad8fd5" class="outline-3">
<h3 id="orgfad8fd5"><span class="done DONE">DONE</span> 跟读至背诵</h3>
<div class="outline-text-3" id="text-orgfad8fd5">
</div>
</div>
<div id="outline-container-orgcf9cc60" class="outline-3">
<h3 id="orgcf9cc60">Ask me if 写+读</h3>
<div class="outline-text-3" id="text-orgcf9cc60">
<ol class="org-ol">
<li>The man tried to swing the speedboat round. What&#x2026;do<br />
What did the man try to do?<br /></li>
<li>The steering wheel came away in his hands as he did so. When<br />
When did the steering wheel come away in his hands?<br /></li>
<li>He waved desperately to his companion. Who&#x2026;to/Why/When<br />
Who did he wave desperately to?<br />
Why did he wave desperately to his companion?<br />
When did he wave desperately to his companion?<br /></li>
<li>He was water skiing. What&#x2026;doing<br />
What was he doing?<br /></li>
<li>He had been water skiing for the last fifteen minutes. How long/Who<br />
How long had he been water skiing?<br />
Who had been water skiing for the last fifteen minutes?<br /></li>
<li>Both men were thrown violently into the sea. How/When/Who<br />
How were both men thrown into the sea?<br />
When were both men thrown violently into the sea?<br />
Who were thrown violently into the sea?<br /></li>
<li>They had hardly had time to realize what was happening. How much time<br />
How much time had they had to realize what was happening?<br /></li>
<li>The boat had struck a buoy. What<br />
What had the boat struck?<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgdfe0cd2" class="outline-3">
<h3 id="orgdfe0cd2"><span class="done DONE">DONE</span> 摘要写作</h3>
<div class="outline-text-3" id="text-orgdfe0cd2">
<p>
The moment the speedboat struck the buoy, both men were thrown into the water.<br />
As it was moving off very quickly across the water,<br />
	both men begun to swim towards the shore.<br />
Turning in a circle, the speedboat came straight towards them.<br />
After it had just missed them, both men swam util they were on out of danger.<br />
When the boat returned it had lost speed.<br />
Soon all the petrol was used up and it floated across the water.<br />
</p>

<p>
Because the speedboat struck the buoy, both men were thrown into the water.<br />
It was moving off very quickly<br />
	and, while the men were swimming towards the shore,<br />
		it turned in a circle, came straight towards them and only just missed them.<br />
The men had no sooner swum out of danger than the boat returned.<br />
This time, however, it lost speed because all the petrol was used up<br />
	and it floated across the water.<br />
</p>
</div>
</div>

<div id="outline-container-orgb74c6c5" class="outline-3">
<h3 id="orgb74c6c5"><span class="done DONE">DONE</span> tell the story 口语</h3>
<div class="outline-text-3" id="text-orgb74c6c5">
</div>
</div>
<div id="outline-container-org791de3a" class="outline-3">
<h3 id="org791de3a">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
